{
  "career": [
    {
      "name": "Kuldip Oswal Hosiery Mills Pvt. Ltd.",
      "href": "https://kohmpl.com/",
      "title": "Software Developer and Consultant",
      "logo": "/kohm.png",
      "start": "May 2025",
      "end": "Present",
      "description": [
        "Designed and implemented an inventory management and fabric booking system using FastAPI (Python) with a PostgreSQL database, ensuring scalability and reliability.",
        "Developed a Next.js front-end with JWT-based authentication, providing secure and seamless access for users.",
        "Optimized the system’s user interface for non-technical staff, improving usability and adoption across the organization."
      ]
    },
    {
      "name": "State Art Corp.",
      "href": "https://stateartcorp.com/",
      "title": "Data Migration Internship",
      "logo": "/sac.avif",
      "start": "Jun 2023",
      "end": "Jul 2023",
      "description": [
        "Executed a two-week data migration project, implementing measures to ensure accessibility and data integrity throughout the process.",
        "Enhanced database usability by adding multi-user access support, resulting in a 2x improvement in operational efficiency."
      ]
    },
    {
      "name": "Chahat Accessories",
      "href": "https://chahataccessories.com/",
      "title": "Web Development Internship",
      "logo": "/chahataccessories.avif",
      "start": "Jan 2023",
      "end": "Mar 2023",
      "description": [
        "Designed and revamped the company’s e-commerce platform, increasing customer retention by 3x through improved performance and user experience.",
        "Implemented modern front-end development practices and optimized site architecture, driving a 5x increase in website traffic and strengthening the brand’s online presence."
      ]
    },
    {
      "name": "Freelance",
      "title": "Video Editor",
      "href": "https://youtube.com/",
      "logo": "/premiere.png",
      "start": "Dec 2019",
      "end": "Mar 2023",
      "description": [
        "Edited and produced content that generated 75M+ impressions, leveraging industry trends to maximize reach and engagement.",
        "Analyzed audience insights to optimize video structure and pacing, increasing average watch time by 3.5 minutes."
      ]
    }
  ]
}
